; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	thermograph1 - mode
	infrared0 - mode
	Star0 - direction
	Star1 - direction
	GroundStation7 - direction
	Star8 - direction
	Star4 - direction
	GroundStation5 - direction
	Star2 - direction
	Star9 - direction
	Star3 - direction
	Star6 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
	Star12 - direction
	Planet13 - direction
	Planet14 - direction
	Star15 - direction
	Star16 - direction
)
(:init
	(supports instrument0 infrared0)
	(calibration_target instrument0 Star4)
	(calibration_target instrument0 Star8)
	(calibration_target instrument0 GroundStation5)
	(supports instrument1 thermograph1)
	(supports instrument1 infrared0)
	(calibration_target instrument1 GroundStation5)
	(calibration_target instrument1 Star6)
	(calibration_target instrument1 Star3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star8)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 Star3)
	(calibration_target instrument2 Star2)
	(supports instrument3 infrared0)
	(calibration_target instrument3 Star6)
	(calibration_target instrument3 Star3)
	(calibration_target instrument3 Star9)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon11)
)
(:goal (and
	(pointing satellite0 Star3)
	(pointing satellite1 Star8)
	(have_image Phenomenon10 infrared0)
	(have_image Phenomenon11 thermograph1)
	(have_image Star12 thermograph1)
	(have_image Planet13 infrared0)
	(have_image Planet14 thermograph1)
	(have_image Star15 infrared0)
	(have_image Star16 thermograph1)
))

)

; plan
1. (turn_to satellite0 groundstation5 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 groundstation5)
   goals met: 0 of 9
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 9
3. (calibrate satellite0 instrument1 groundstation5)
   added: (calibrated instrument1)
   goals met: 0 of 9
4. (turn_to satellite0 planet13 groundstation5)
   deleted: (pointing satellite0 groundstation5)
   added: (pointing satellite0 planet13)
   goals met: 0 of 9
5. (take_image satellite0 planet13 instrument1 infrared0)
   added: (have_image planet13 infrared0)
   goals met: 1 of 9
6. (turn_to satellite0 phenomenon11 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 phenomenon11)
   goals met: 1 of 9
7. (take_image satellite0 phenomenon11 instrument1 thermograph1)
   added: (have_image phenomenon11 thermograph1)
   goals met: 2 of 9
8. (turn_to satellite0 phenomenon10 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 phenomenon10)
   goals met: 2 of 9
9. (take_image satellite0 phenomenon10 instrument1 infrared0)
   added: (have_image phenomenon10 infrared0)
   goals met: 3 of 9
10. (turn_to satellite0 planet14 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 planet14)
   goals met: 3 of 9
11. (take_image satellite0 planet14 instrument1 thermograph1)
   added: (have_image planet14 thermograph1)
   goals met: 4 of 9
12. (turn_to satellite0 star12 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 star12)
   goals met: 4 of 9
13. (take_image satellite0 star12 instrument1 thermograph1)
   added: (have_image star12 thermograph1)
   goals met: 5 of 9
14. (turn_to satellite0 star15 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star15)
   goals met: 5 of 9
15. (take_image satellite0 star15 instrument1 infrared0)
   added: (have_image star15 infrared0)
   goals met: 6 of 9
16. (turn_to satellite0 star16 star15)
   deleted: (pointing satellite0 star15)
   added: (pointing satellite0 star16)
   goals met: 6 of 9
17. (take_image satellite0 star16 instrument1 thermograph1)
   added: (have_image star16 thermograph1)
   goals met: 7 of 9
18. (turn_to satellite0 star3 star16)
   deleted: (pointing satellite0 star16)
   added: (pointing satellite0 star3)
   goals met: 8 of 9
19. (turn_to satellite1 star8 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 star8)
   goals met: 9 of 9
